{
  "illandril-token-hud-scale.setting.effectIconsPerRow.label": "Effect Icons per Row / Col",
  "illandril-token-hud-scale.setting.effectIconsPerRow.hint": "Adjusts the scale of Effect icons so that this many icons appear per row (column if Horizontal Effect Icons is uncheck) of icons (as shown on the token).",

  "illandril-token-hud-scale.setting.effectIconsHorizontal.label": "Horizontal Effect Icons",
  "illandril-token-hud-scale.setting.effectIconsHorizontal.hint": "Show the Effect icons horizontally. Uncheck to show the Effect icons vertically.",

  "illandril-token-hud-scale.setting.hudButtonScale.label": "Token HUD Buttons Scale",
  "illandril-token-hud-scale.setting.hudButtonScale.hint": "Select the scale (multiplier relative to the default scale) of the Token HUD Buttons (Toggle Visibility, Assign Status Effects, Toggle Combat State, etc). Set to 1 to leave the scale unchanged from the default scale.",

  "illandril-token-hud-scale.setting.enableStaticSizedHUD.label": "Static Sized HUD",
  "illandril-token-hud-scale.setting.enableStaticSizedHUD.hint": "Keep the size of the HUD consistent when you zoom in and out of the scene (as opposed to getting smaller as you zoom out from the scene, and larger as you zoom in). Note: You most likely will want to reduce Token HUD Buttons Scale to something below 1.5 if you enable this setting.",

  "illandril-token-hud-scale.upgradeNotification.v2": "Illandril's Token HUD Scale has been updated. There have been significant changes to how Token HUD scaling works, so check your settings. Most will either want a Static Sized HUD with a lower (0.5-1.5) scale, or non-Static Sized HUD with a higher (1.5+) scale.",

  "illandril-token-hud-scale.setting.enableStatusSelectorScale.label": "Scale Status Effect Assignment Icons",
  "illandril-token-hud-scale.setting.enableStatusSelectorScale.hint": "Increases the size of the Status Effect icons shown under the Assign Status Effects button to match the size of the other Token HUD Buttons.",

  "illandril-token-hud-scale.setting.darkenHUDButtonBG.label": "Darken Token HUD Backgrounds",
  "illandril-token-hud-scale.setting.darkenHUDButtonBG.hint": "Reduces the opacity of the Token HUD button background color to improve contrast."
}
